views/barang/_form.php


    <?= $form->field($model, 'satuan')->textInput(['maxlength' => true]) ?>

    <?= $form->field($model, 'id_jenis')->dropDownList(ArrayHelper::map(Jenis::find()->all(),'id','nama_jenis'),['prompt' => 'Pilih'])->label('Jenis'); ?>

    <?= $form->field($model, 'id_supplier')->dropDownList(ArrayHelper::map(Supplier::find()->all(),'id','nama_supplier'), ['prompt' => 'Pilih'])->label('Supplier'); ?>
---
SELECT * FROM `jenis`
SELECT * FROM `supplier`